/* eslint-disable */

/**
 * 此项目配置为方便新人使用，已缩减至最简配置。
 * 如若想使用更多功能，请查考文档中的 【3. config参数说明】 
 * 自行添加属性，以支持更多个性化功能
 */
const USER_CONFIG = {
 COURSE_SCHEDULE: true,
   USE_PASSAGE: 'push-deer',
  // 使用微信测试号：公众号APP_ID
//   APP_ID: '',

  // 使用微信测试号：公众号APP_SECRET
//   APP_SECRET: '',

  PROVINCE: '河南',
  CITY: '鹤壁',

  USERS: [
    {
      // 想要发送的人的名字
      name: '宝贝',
      // 使用微信测试号：扫码关注你的微信测试号后生成的一段字符串，在测试号后台能看到
      id: 'PDU21505TEORu55qgil8oVWoIsAsRypLXWd62dI0D',
      // 使用微信测试号：你想对他发送的模板消息的模板ID
      useTemplateId: '0001',
      // 新历生日, 仅用作获取星座运势, 格式必须为MM-DD
      horoscopeDate: '09-29',
       courseSchedule: {
        // 单双周的基准
        benchmark: {
          // 这里设置一个日期，用来作为判断课表是否单双周的依据
          date: '2022-03-23',
          // 该日期是否为单周
          isOdd: true
        },
        // 课表
        courses: {
          // 单周课表
          // 从星期一到星期日（星期六和星期日的课表数组可不填写）
          odd: [
            // 例子，周一的课表
            [
              '10:10-12:00 口腔医学美学 教室：@D506'
            ],
            // 周二
            [
              '08:00-09:50 医患沟通 教室：@3214',
              '10:10-12:00 习近平新时代中国特色主义思想概论 教室：@3202',
              '14:00-15:50 体育与健康IV 教室：操场',
              '16:10-18:00 口腔医学医美 教室：@D506',
            ],
            // 周三
            [
              '08:00-09:50 全口义齿工艺技术 教室：@D504',
              '10:10-12:00 形体训练 教室：@1528',
              '14:00-15:50 创新创业教育 教室 @3205',
            ],
            // 周四
            [
              '08:00-12:00 固定义齿工艺技术 教室：@D509',
              '14:00-15:50 数字化口腔修复技术 教室：@D506',
            ],
            // 周五
            [
              '08:00-12:00 全口义齿工艺技术 教室：@D504',
              '14:00-15:50 固定义齿工艺技术 教室：@D509',
            ],
            // 周六
            [],
            // 周日
            []
          ],
          // 双周课表
          even: [
            [
              '10:10-12:00 口腔医学美学 教室：@D506'
            ],
            // 周二
            [
              '08:00-09:50 医患沟通 教室：@3214',
              '10:10-12:00 习近平新时代中国特色主义思想概论 教室：@3202',
              '14:00-15:50 体育与健康IV 教室：操场',
              '16:10-18:00 口腔医学医美 教室：@D506',
            ],
            // 周三
            [
              '08:00-09:50 全口义齿工艺技术 教室：@D504',
              '10:10-12:00 形体训练 教室：@1528',
              '14:00-15:50 创新创业教育 教室 @3205',
            ],
            // 周四
            [
              '08:00-12:00 固定义齿工艺技术 教室：@D509',
              '14:00-15:50 数字化口腔修复技术 教室：@D506',
            ],
            // 周五
            [
              '08:00-12:00 全口义齿工艺技术 教室：@D504',
              '14:00-15:50 固定义齿工艺技术 教室：@D509',
            ],
            // 周六
            [],
            // 周日
            []
          ]
          
        }
      },
      festivals: [
        // 注意：此条配置日期为阴历日期，因为`type`中 “生日” 之前有 * 符号
        {
           type: '生日', name: '心如宝贝', year: '2023', date: '09-07',
        },
        // 注意：此条配置日期为阳历日期，因为`type`中 “生日” 之前没有 * 符号
        {
            type: '生日', name: '龙geigei', year: '2024', date: '01-04',
        },
        {
          type: '节日', name: '相识纪念日', year: '2021', date: '05-03',
        },
      ],
      // 我们在一起已经有xxxx天了的配置
      customizedDateList: [
        // 在一起的日子
        { keyword: 'love_day', date: '2021-05-03' },
        // 结婚纪念日
        { keyword: 'marry_day', date: '2022-09-09' },
      ],
    },
  ],


  // 【推送完成提醒】模板id, 用来看自己有没有发送成功的那个模板
  CALLBACK_TEMPLATE_ID: '',

  CALLBACK_USERS: [
    {
      name: '自己',
      // 使用微信测试号：自己的微信id，扫码关注你的微信测试号后生成的一段字符串，在测试号后台能看到
      id: '',
    }
  ],

}

module.exports = USER_CONFIG

